#include "SSD1306.h"

extern struct StateType State;

void WriteCmd1306(uint8_t Cmd, uint8_t *pBuff, uint16_t BuffLen)
{
    SSD1306_DC_LOW();
    SSD1306_CS_LOW();
    SPI1_Write(&Cmd, 1);
    SPI1_Write(pBuff, BuffLen);
    SSD1306_CS_HIGH();
}  
//--------------------------------------------------------------------------------
void WriteData1306(uint8_t *pBuff, uint16_t BuffLen)
{
    SSD1306_DC_HIGH();
    SSD1306_CS_LOW();
    SPI1_Write(pBuff, BuffLen);//*
    SSD1306_CS_HIGH();
    SSD1306_DC_LOW();  
}
//--------------------------------------------------------------------------------
void SSD1306_Init(void)
{
    SSD1306_GPIO_init();

    // Сброс контроллера дисплея ssd1306 ножкой Reset
    SSD1306_RESET_HIGH();
    delay_ms(2);
    SSD1306_RESET_LOW();  // Роняем ножку reset в 0 на 10 мс
    delay_ms(15);
    SSD1306_RESET_HIGH();
    
    // Шлём команды инициализации ssd1306
    SSD1306_Sleep();
    SSD1306_SetDisplayClockDivider(1, 8);
    SSD1306_SetMultiplexRatio(SSD1306_Height);
    SSD1306_SetDisplayOffset(0);
    SSD1306_SetDisplayStartLine(0);
    SSD1306_ChargePumpSetting(1);
    SSD1306_SetMemAdressingMode(SSD1306_Adressing_Horizontal);
    SSD1306_SetSegmentRemap(0);          // *меняет направление заполнение матрицы из буфера кадра (вертикаль/горизонталь)
    SSD1306_SetCOMoutScanDirection(0);    // *переворачивает оторбражение на матрице (только по вертикали)
    SSD1306_SetCOMPinsConfig(1, 0);
    SSD1306_SetContrast((100/State.Brigtness)*255);
    SSD1306_SetPrechargePeriod(2, 2);
    SSD1306_SetVCOMHDeselectLevel(0x40);
    SSD1306_AllPixRAM();
    SSD1306_SetInverseOff();
    SSD1306_DeactivateScroll();
    SSD1306_Wake();
}
//--------------------------------------------------------------------------------
//==============================================================================
// Процедура переводит дисплей в режим сна
//==============================================================================
void SSD1306_Sleep(void)
{
  WriteCmd1306(SSD1306_CMD_Sleep, 0, 0);
}
//==============================================================================
// Смещение по вертикали области отображения относительно памяти кадра
//==============================================================================
void SSD1306_SetDisplayOffset(uint8_t Offset)
{
  WriteCmd1306(SSD1306_CMD_SetDisplayOffset, &Offset, 1);
}
//==============================================================================

//==============================================================================
void SSD1306_SetDisplayClockDivider(uint8_t DCLKdiv, uint8_t Fosc)
{
  DCLKdiv--;
  DCLKdiv &= 0x0F;
  DCLKdiv |= ((Fosc & 0x0F) << 4);
  WriteCmd1306(SSD1306_CMD_SetDisplayClockDivider, &DCLKdiv, 1);
}
//==============================================================================

//==============================================================================
void SSD1306_ChargePumpSetting(uint8_t Value)
{
  Value = Value ? 0x14 : 0x10;
  WriteCmd1306(SSD1306_CMD_ChargePumpSetting, &Value, 1);
}
//==============================================================================
// Процедура выводит дисплей из режима сна
//==============================================================================
void SSD1306_Wake(void)
{
  WriteCmd1306(SSD1306_CMD_Wake, 0, 0);
}
//==============================================================================

//==============================================================================
void SSD1306_SetMultiplexRatio(uint8_t Mux)
{
  Mux--;
  Mux &= 0x3F;
  WriteCmd1306(SSD1306_CMD_SetMultiplexRatio, &Mux, 1);
}
//==============================================================================
// Set display RAM display start line register from 0-63
//==============================================================================
void SSD1306_SetDisplayStartLine(uint8_t Line)
{
  Line &= 0x3F;
  WriteCmd1306(SSD1306_CMD_SetDisplayStartLine | Line, 0, 0);
}
//==============================================================================
//==============================================================================
// Value=0: column address 0 is mapped to SEG0 (RESET)
// Value=1: column address 127 is mapped to SEG0 
//==============================================================================
void SSD1306_SetSegmentRemap(uint8_t Value)
{
  Value = Value ? 1 : 0;
  WriteCmd1306(SSD1306_CMD_SetSegmentRemap | Value, 0, 0);
}
//==============================================================================
//==============================================================================
// Процедура устанавливает № строки, по которой указатель в буфере кадра будет перемещаться
// Только для режима автосдвига указателя (SSD1306_Adressing_Page)
//==============================================================================
void SSD1306_PageAddrMode_StartColumn(uint8_t Start)
{
  Start &= 0x7F;
  WriteCmd1306(SSD1306_CMD_PageAddrMode_StartColumnLo | (Start & 0x07), 0, 0);
  WriteCmd1306(SSD1306_CMD_PageAddrMode_StartColumnHi | (Start >> 4), 0, 0);
}
//==============================================================================
//==============================================================================
// Процедура устанавливает страницу для режима страничной адрессациии, когда
// сдвиг указателя в памяти делается только по горизонтали (SSD1306_Adressing_Page).
//==============================================================================
void SSD1306_PageAddrMode_SetPage(uint8_t Page)
{
  Page &= 0x07;
  WriteCmd1306(SSD1306_CMD_PageAddrMode_SetPage | Page, 0, 0);
}
//==============================================================================
//==============================================================================
// Процедура устанавливает начальный и конечный индекс страницы 
// для автосмещения указателя в памяти кадра при чтении записи.
//==============================================================================
void SSD1306_SetPages(uint8_t Start, uint8_t End)
{
  Start &= 0x07;
  End &= 0x07;
  uint8_t Buff[] = {Start, End};
  WriteCmd1306(SSD1306_CMD_SetPageAddr, Buff, 2);
}
//==============================================================================
//==============================================================================
// Процедура устанавливает начальный и конечный индекс колонки 
// для автосмещения указателя в памяти кадра при чтении записи.
//==============================================================================
void SSD1306_SetColumns(uint8_t Start, uint8_t End)
{
  Start &= 0x7F;
  End &= 0x7F;
  uint8_t Buff[] = {Start, End};
  WriteCmd1306(SSD1306_CMD_SetColumnAddr, Buff, 2);
}
//==============================================================================
//==============================================================================
// Процедура устанавливает режим автосдвига указателя в буфере кадра ssd1306
//==============================================================================
void SSD1306_SetMemAdressingMode(uint8_t Mode)
{
  if (Mode > 2)
    return;
  
  WriteCmd1306(SSD1306_CMD_SetMemAdressingMode | Mode , 0, 0);
}
//==============================================================================
//==============================================================================
// Процедура передаёт в дисплей буфер кадра из массива pBuff
//==============================================================================
void SSD1306_DisplayFullUpdate(uint8_t *pBuff, uint16_t BuffLen)
{
  SSD1306_SetColumns(0, SSD1306_Width - 1);
  SSD1306_SetPages(0, (SSD1306_Height >> 3) - 1);
  WriteData1306(pBuff, BuffLen);
}
//==============================================================================
// Направление сканирования
// Value=0: normal mode (RESET) Scan from COM0 to COM[N –1]
// Value=1: remapped mode. Scan from COM[N-1] to COM0
// Where N is the Multiplex ratio. 
//==============================================================================
void SSD1306_SetCOMoutScanDirection(uint8_t Value)
{
  Value = Value ? 0x08 : 0x00;
  WriteCmd1306(SSD1306_CMD_SetCOMoutScanDirection | Value, 0, 0);
}
//==============================================================================
// AltCOMpinConfig=0: Sequential COM pin configuration
// AltCOMpinConfig=1(RESET): Alternative COM pinconfiguration
// LeftRightRemap=0(RESET): Disable COM Left/Right remap
// LeftRightRemap=1: Enable COM Left/Right remap 
//==============================================================================
void SSD1306_SetCOMPinsConfig(uint8_t AltCOMpinConfig, uint8_t LeftRightRemap)
{
  uint8_t tmpValue = (1 << 1);
  if (AltCOMpinConfig)
    tmpValue |= (1 << 4);
  if (LeftRightRemap)
    tmpValue |= (1 << 5);
  WriteCmd1306(SSD1306_CMD_SetCOMPinsConfig, &tmpValue, 1);
}
//==============================================================================
// Процедура устанавливает параметр контрастности (0-255)
//==============================================================================
void SSD1306_SetContrast(uint8_t Value)
{
  WriteCmd1306(SSD1306_CMD_SetContrast, &Value, 1);
}
//==============================================================================

//==============================================================================
void SSD1306_SetPrechargePeriod(uint8_t Phase1period, uint8_t Phase2period)
{
  Phase1period &= 0x0F;
  Phase1period &= 0x0F;
  if (!Phase1period)
    Phase1period = 2;
  if (!Phase2period)
    Phase2period = 2;
  Phase1period |= (Phase2period << 4);
  WriteCmd1306(SSD1306_CMD_SetPrechargePeriod, &Phase1period, 1);
}
//==============================================================================
void SSD1306_SetVCOMHDeselectLevel(uint8_t Code)
{
  Code &= 0x70;
  WriteCmd1306(SSD1306_CMD_SetVCOMHDeselectLevel, &Code, 1);
}
//==============================================================================

//==============================================================================
// Процедура отключает скролл (средствами контроллера дисплея
//==============================================================================
void SSD1306_DeactivateScroll(void)
{
  WriteCmd1306(SSD1306_CMD_DeactivateScroll, 0, 0);
}
//==============================================================================
// Процедура включает все пиксели дисплея (Тест индикатора)
//==============================================================================
void SSD1306_AllPixOn(void)
{
  WriteCmd1306(SSD1306_CMD_AllPixOn, 0, 0);
}
//==============================================================================

//==============================================================================
// Процедура отключает тест дисплея и выводит на него картинку из буфера кадра в ssd1306
//==============================================================================
void SSD1306_AllPixRAM(void)
{
  WriteCmd1306(SSD1306_CMD_AllPixRAM, 0, 0);
}
//==============================================================================

//==============================================================================
// Процедура включает инверсию дисплея
//==============================================================================
void SSD1306_SetInverseOn(void)
{
  WriteCmd1306(SSD1306_CMD_SetInverseOn, 0, 0);
}
//==============================================================================

//==============================================================================
// Процедура отключает инверсию дисплея
//==============================================================================
void SSD1306_SetInverseOff(void)
{
  WriteCmd1306(SSD1306_CMD_SetInverseOff, 0, 0);
}
//==============================================================================




















